Revit 2024 API
TemporaryGraphicsManager.Clear Method
 Clear all temporary graphics objects managed by this manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void Clear()
Visual Basic
Public Sub Clear
Visual C++
public:
void Clear()
See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace